# **CHAPTER 10**
# **Data Aggregation and Group Operations**

## **10.1 GroupBy Mechanics**

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [2]:
df

  key1 key2     data1     data2
0    a  one -0.243925  0.053250
1    a  two -1.254378  0.431793
2    b  one -0.443140 -2.399108
3    b  two  1.941359  0.517481
4    a  one -0.154421  0.268555

In [3]:
grouped = df['data1'].groupby(df['key1'])

In [4]:
 grouped

In [5]:
grouped.mean()

key1
a   -0.550908
b    0.749109
Name: data1, dtype: float64

In [6]:
 means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [7]:
means

key1  key2
a     one    -0.199173
      two    -1.254378
b     one    -0.443140
      two     1.941359
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a    -0.199173 -1.254378
b    -0.443140  1.941359

In [9]:
 states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [11]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.254378
            2006   -0.443140
Ohio        2005    0.848717
            2006   -0.154421
Name: data1, dtype: float64

In [12]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.550908  0.251199
b     0.749109 -0.940813

In [13]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.199173  0.160902
     two  -1.254378  0.431793
b    one  -0.443140 -2.399108
     two   1.941359  0.517481

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### **Iterating Over Groups**

In [15]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.243925  0.053250
1    a  two -1.254378  0.431793
4    a  one -0.154421  0.268555
b
  key1 key2     data1     data2
2    b  one -0.443140 -2.399108
3    b  two  1.941359  0.517481

In [16]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.243925  0.053250
4    a  one -0.154421  0.268555
('a', 'two')
  key1 key2     data1     data2
1    a  two -1.254378  0.431793
('b', 'one')
  key1 key2    data1     data2
2    b  one -0.44314 -2.399108
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.941359  0.517481

In [17]:
pieces = dict(list(df.groupby('key1')))

In [18]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.443140 -2.399108
3    b  two  1.941359  0.517481

In [19]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [20]:
grouped = df.groupby(df.dtypes, axis=1)

In [21]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.243925  0.053250
1 -1.254378  0.431793
2 -0.443140 -2.399108
3  1.941359  0.517481
4 -0.154421  0.268555
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### **Selecting a Column or Subset of Columns**

In [22]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [23]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [24]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.160902
     two   0.431793
b    one  -2.399108
     two   0.517481

In [25]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [26]:
s_grouped

In [27]:
s_grouped.mean()

key1  key2
a     one     0.160902
      two     0.431793
b     one    -2.399108
      two     0.517481
Name: data2, dtype: float64

### **Grouping with Dicts and Series**

In [28]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [29]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [30]:
people

               a         b         c         d         e
Joe    -0.116716  1.810617  3.167889 -1.142843  0.561354
Steve  -0.311624  0.689523 -0.165952 -0.147513  0.186327
Wes    -1.177998       NaN       NaN  1.076708  1.328238
Jim     0.523880  0.531997  0.207834  1.258643 -0.128020
Travis -1.590027 -0.620062  0.649835 -0.579505 -1.236379

In [31]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [32]:
by_column = people.groupby(mapping, axis=1)

In [33]:
 by_column.sum()

            blue       red
Joe     2.025046  2.255254
Steve  -0.313465  0.564226
Wes     1.076708  0.150239
Jim     1.466477  0.927857
Travis  0.070330 -3.446468

In [34]:
map_series = pd.Series(mapping)

In [35]:
 map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [36]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### **Grouping with Functions**

In [38]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.770834  2.342614  3.375723  1.192508  1.761571
5 -0.311624  0.689523 -0.165952 -0.147513  0.186327
6 -1.590027 -0.620062  0.649835 -0.579505 -1.236379

In [39]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [40]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.177998  1.810617  3.167889 -1.142843  0.561354
  two  0.523880  0.531997  0.207834  1.258643 -0.128020
5 one -0.311624  0.689523 -0.165952 -0.147513  0.186327
6 two -1.590027 -0.620062  0.649835 -0.579505 -1.236379

### **Grouping by Index Levels**

In [41]:
 columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                      [1, 3, 5, 1, 3]],
                                     names=['cty', 'tenor'])

In [42]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [43]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.783737  0.685223 -1.815289  2.117011  0.258503
1     -0.975954 -0.422736  0.294538  0.406768 -0.474869
2     -0.861723 -0.695503  0.076125 -0.563154  1.088421
3     -1.002516 -1.365542  1.404626  0.891609 -0.972227

In [44]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## **10.2 Data Aggregation**

In [45]:
df

  key1 key2     data1     data2
0    a  one -0.243925  0.053250
1    a  two -1.254378  0.431793
2    b  one -0.443140 -2.399108
3    b  two  1.941359  0.517481
4    a  one -0.154421  0.268555

In [46]:
grouped = df.groupby('key1')

In [47]:
grouped['data1'].quantile(0.9)

key1
a   -0.172321
b    1.702909
Name: data1, dtype: float64

In [48]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [49]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.099958  0.378543
b     2.384499  2.916590

In [50]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.550908  0.610865 -1.254378 -0.749151 -0.243925 -0.199173
b      2.0  0.749109  1.686096 -0.443140  0.152985  0.749109  1.345234

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.154421   3.0  0.251199  0.189867  0.053250  0.160902  0.268555
b     1.941359   2.0 -0.940813  2.062340 -2.399108 -1.669961 -0.940813


           75%       max
key1
a     0.350174  0.431793
b    -0.211666  0.517481

### **Column-Wise and Multiple Function Application**

In [55]:
tips = pd.read_csv('../examples/tips.csv')

In [56]:
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [57]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [58]:
grouped = tips.groupby(['day', 'smoker'])

In [59]:
grouped_pct = grouped['tip_pct']

In [60]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [61]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [62]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [63]:
functions = ['count', 'mean', 'max']

In [64]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

<ipython-input-64-426117f1e146>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['tip_pct', 'total_bill'].agg(functions)

In [65]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [66]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [68]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [69]:
 grouped['tip_pct', 'total_bill'].agg(ftuples)

<ipython-input-69-c2b2ffd79840>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [70]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [72]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### **Returning Aggregated Data Without Row Indexes**

In [73]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## **10.3 Apply: General split-apply-combine**